{
  "origin.touhouorigins.vampire.name": "Vampire",
  "origin.touhouorigins.vampire.description": "A young but powerful species of youkai, considered to be a type of devil. They possess a far broader range of abilities than most youkai.",

  "power.touhouorigins.superiority.name": "Superiority",
  "power.touhouorigins.superiority.description": "You deal more damage and move faster.",
  "power.touhouorigins.moonlight_aura.name": "Moonlight Aura",
  "power.touhouorigins.moonlight_aura.description": "You gain night vision when exposed to the moon.",
  "power.touhouorigins.vampirism.name": "Vampirism",
  "power.touhouorigins.vampirism.description": "Killing living creatures heals you and provides a short strength boost.",
  "power.touhouorigins.scorching_sun.name": "Scorching Sun",
  "power.touhouorigins.scorching_sun.description": "Direct sunlight will slowly vaporize you unless under the effect of fire resistance.",
  "power.touhouorigins.banes_of_the_immortal.name": "Banes of the Immortal",
  "power.touhouorigins.banes_of_the_immortal.description": "You are greatly slowed and will die while in flowing water, burn faster than most other beings, and are weak to golden tools.",

  "origin.touhouorigins.oni.name": "Oni",
  "origin.touhouorigins.oni.description": "These ogre-like youkai possess incredible strength and power. They love to drink, feast, and compete with humans.",

  "power.touhouorigins.brawn_of_the_oni.name": "Brawn of the Oni",
  "power.touhouorigins.brawn_of_the_oni.description": "Increased height, health, and natural strength makes you one formidable and fearsome opponent.",
  "power.touhouorigins.drunken_stupor.name": "Drunken Stupor",
  "power.touhouorigins.drunken_stupor.description": "For every negative status effect active on you, gain 3 melee damage.",
  "power.touhouorigins.heavy_drinker.name": "Heavy Drinker",
  "power.touhouorigins.heavy_drinker.description": "You are sustained significantly less by food, but gain 8 hunger points when drinking any potion.",
  "power.touhouorigins.brute_force.name": "Brute Force",
  "power.touhouorigins.brute_force.description": "You prefer to settle disputes with your raw, natural strength, and are ungraceful with finesse weapons. Melee weapons are less effective in combat.",

  "origin.touhouorigins.fairy.name": "Fairy",
  "origin.touhouorigins.fairy.description": "Fairies are small, simple, humanoid creatures of magic that represent aspects of nature. Many of them are also simple-minded.",

  "power.touhouorigins.regeneration.name": "Regeneration",
  "power.touhouorigins.regeneration.description": "You can rapidly heal yourself for 5 seconds.",
  "power.touhouorigins.fluttering_wings.name": "Fluttering Wings",
  "power.touhouorigins.fluttering_wings.description": "You may float around freely by holding jump, but every second of flight consumes 1 hunger point. You may not take flight while starving, as you do not have enough energy to muster it.",
  "power.touhouorigins.aspect_of_nature.name": "Aspect of Nature",
  "power.touhouorigins.aspect_of_nature.description": "You do not require food to survive, but can only eat plant-based food to retain energy for flight.",
  "power.touhouorigins.fodder.name": "Fodder",
  "power.touhouorigins.fodder.description": "You have 4 less hearts of health and you're 25% smaller.",

  "origin.touhouorigins.kappa.name": "Kappa",
  "origin.touhouorigins.kappa.description": "Kappa are a type of youkai that live in rivers. They are technologically gifted and produce various tools with skillful hands. All kappa are extremely fond of cucumbers.",

  "power.touhouorigins.optical_camouflage.name": "Optical Camouflage",
  "power.touhouorigins.optical_camouflage.description": "You can activate a cloaking device to become invisible for a short period of time.",
  "power.touhouorigins.portable_crafting_interface.name": "PCI",
  "power.touhouorigins.portable_crafting_interface.description": "At any time you can deploy a 3x3 crafting interface.",
  "power.touhouorigins.aquabatics.name": "Aquabatics",
  "power.touhouorigins.aquabatics.description": "You swim faster and can hold your breath underwater for much longer.",
  "power.touhouorigins.kappa_out_of_water.name": "Kappa Out of Water",
  "power.touhouorigins.kappa_out_of_water.description": "If you're out of water for too long, you will receive weakness and slowness. You are immune to weakness and slowness while submerged in water.",
  "power.touhouorigins.soul_snatch.name": "Soul Snatch",
  "power.touhouorigins.soul_snatch.description": "Attack someone from behind while sneaking to attempt to steal their shirikodama, dealing massive damage. This requires an empty hand and camouflage turned off. Killing your target restores some hunger points and saturation, if not undead. Whether or not the attack succeeds, this power will then go on a cooldown.",

  "origin.touhouorigins.satori.name": "Satori",
  "origin.touhouorigins.satori.description": "Satori are a type of mountain-dwelling youkai in Japanese folklore. They are famous for being the youkai that are able to read human thoughts.",
  "origin.touhouorigins.satori.announcement": "Your soul screams in horror as your mind starts slipping away, and is quickly replaced with total silence",

  "power.touhouorigins.mind_reading.name": "Mind Reading",
  "power.touhouorigins.mind_reading.description": "Satori are capable of reading others' minds, enabling you to sense their presence and intent quite easily.",
  "power.touhouorigins.recollection.name": "Recollection",
  "power.touhouorigins.recollection.description": "You can bring forth and tap into people's memories, revealing certain aspects of them.",
  "power.touhouorigins.reclusive_physique.name": "Reclusive Physique",
  "power.touhouorigins.reclusive_physique.description": "You move slower than most people and deal 15% less melee damage.",
  "power.touhouorigins.ostracized.name": "Ostracized",
  "power.touhouorigins.ostracized.description": "Villagers refuse to trade with you.",
  "power.touhouorigins.animal_friends.name": "Animal Friends",
  "power.touhouorigins.animal_friends.description": "You find it a lot easier to interact and work with animals. You can also pet your tamed animals to heal them and yourself.",
  "power.touhouorigins.rejection_of_nature.name": "Rejection of Nature",
  "power.touhouorigins.rejection_of_nature.description": "The source of your powers is in your third eye. If you grow so frustrated with how you're treated, you can sew it shut using a string. The effects of this are permanent.",

  "origin.touhouorigins.satori_closed_eye.description": "If a satori closes their third eye, they will be unable to read others' minds and their consciousness is sealed away.",

  "power.touhouorigins.unconscious_manipulation.name": "Unconscious Manipulation",
  "power.touhouorigins.unconscious_manipulation.description": "You have the power to manipulate the unconscious mind. You're able to appear invisible and silent to others at will.",
  "power.touhouorigins.paranoia.name": "Paranoia",
  "power.touhouorigins.paranoia.description": "You are able to make others near you hear things.",
  "power.touhouorigins.presence_of_no_merit.name": "Presence of No Merit",
  "power.touhouorigins.presence_of_no_merit.description": "All mobs are totally unaware of your presence around them, making every hostile mob neutral towards you.",
  "power.touhouorigins.distracted_state_of_mind.name": "Distracted State of Mind",
  "power.touhouorigins.distracted_state_of_mind.description": "Most of your actions are controlled by your unconscious mind, leaving you unable to perform complex, dexterous tasks. You are unable to use bows, crossbows, and shields.",

  "origin.touhouorigins.crow_tengu.name": "Crow Tengu",
  "origin.touhouorigins.crow_tengu.description": "A tengu is a form of youkai common in Japanese mythology. The crow tengu are similar to anthropomorphic crows with a humanoid body structure.",

  "power.touhouorigins.gust_of_wind.name": "Gust of Wind",
  "power.touhouorigins.gust_of_wind.description": "Unleash the power of the wind to launch yourself in the direction you are looking.",
  "power.touhouorigins.youkai_of_the_sky.name": "Youkai of the Sky",
  "power.touhouorigins.youkai_of_the_sky.description": "The crow tengu are masters of the sky and flight. You have Elytra wings without needing to equip any.",
  "power.touhouorigins.tengu_speed.name": "Tengu's Speed",
  "power.touhouorigins.tengu_speed.description": "As a tengu, you are naturally faster than a regular person.",
  "power.touhouorigins.flight_friendly_body.name": "Flight-Friendly Body",
  "power.touhouorigins.flight_friendly_body.description": "You have lighter bones and a slender build, and so have 3 less hearts of health and cannot wear heavy armor.",
  "power.touhouorigins.reporting_above_clouds.name": "Reporting Above Clouds",
  "power.touhouorigins.reporting_above_clouds.description": "It's in your nature to explore the world and write down all the strange happenings all around, you have no time to tussle with others and hunt. All of your damage is cut in half.",

  "origin.touhouorigins.wolf_tengu.name": "Wolf Tengu",
  "origin.touhouorigins.wolf_tengu.description": "White Wolf Tengu are the \"mountain's defense force\", responsible for keeping out intruders. They're known as avid players of shogi.",

  "power.touhouorigins.warrior_spirit.name": "Warrior's Spirit",
  "power.touhouorigins.warrior_spirit.description": "Unleash your warrior instincts to gain a massive strength boost for a short period of time.",
  "power.touhouorigins.mountainous_blades.name": "Mountainous Blades",
  "power.touhouorigins.mountainous_blades.description": "All swords swing a little slower, but your reach when using them is increased.",
  "power.touhouorigins.clumsy_archer.name": "Clumsy Archer",
  "power.touhouorigins.clumsy_archer.description": "You are less accurate with a bow.",
  "power.touhouorigins.big_appetite.name": "Big Appetite",
  "power.touhouorigins.big_appetite.description": "You require more food to sate your warrior body.",

  "origin.touhouorigins.ghost.name": "Ghost",
  "origin.touhouorigins.ghost.description": "Ghosts are the souls of humans who have remained in the physical world. Although they are souls, they have a body temperature and are fully corporeal.",

  "power.touhouorigins.hardened_soul.name": "Hardened Soul",
  "power.touhouorigins.hardened_soul.description": "Your ghost form grants you immunity to poison and nausea.",
  "power.touhouorigins.fading_body.name": "Fading Body",
  "power.touhouorigins.fading_body.description": "While your ethereal body is more fragile (5 less hearts) than that of a mortal person, you regenerate health very quickly.",
  "power.touhouorigins.apparition_appetite.name": "Apparition's Appetite",
  "power.touhouorigins.apparition_appetite.description": "You do not require food to stay alive.",
  "power.touhouorigins.futile_concoctions.name": "Futile Concoctions",
  "power.touhouorigins.futile_concoctions.description": "You are unable to drink potions.",
  "power.touhouorigins.withering_soul.name": "Withering Soul",
  "power.touhouorigins.withering_soul.description": "Standing on soul sand or soul soil will slowly wither away your spirit, unless wearing boots enchanted with soul speed.",

  "origin.touhouorigins.celestial.name": "Celestial",
  "origin.touhouorigins.celestial.description": "Celestials are former humans, a type of hermit that live in Heaven. Celestials can be divided in two classes: those who gained immortality and ascended to Heaven, and those who attained enlightenment and entered Nirvana after death.",
  "origin.touhouorigins.celestial.announcementEnlightened": "You are now enlightened",
  "origin.touhouorigins.celestial.announcementImmortal": "You are now immortal",

  "power.touhouorigins.divine_luck.name": "Divine Luck",
  "power.touhouorigins.divine_luck.description": "No matter where you go, fortune smiles upon you. Increased luck attribute.",
  "power.touhouorigins.lavish_lifestyle.name": "Lavish Lifestyle",
  "power.touhouorigins.lavish_lifestyle.description": "You refuse to eat food that is not crafted but are much more fulfilled from craftable food.",
  "power.touhouorigins.path_to_enlightenment.name": "Path to Enlightenment",
  "power.touhouorigins.path_to_enlightenment.description": "(Chosen with Elytra) The path to enlightenment results in inner peace and reaching Nirvana after death. By choosing this path you secure yourself the ability to return to earth after death. Although physically weaker, you no longer drop items on death, are much more attuned with gathering materials, and no longer need to eat.",
  "power.touhouorigins.path_to_immortality.name": "Path to Immortality",
  "power.touhouorigins.path_to_immortality.description": "(Chosen with Totem of Undying) The path to immortality results in a body hardened to survive and totally free from the shackles of age. Along with physical capabilities being raised, you now have a Divinity bar. As long as you have Divinity, you are unable to die. Divinity passively goes down as you run around, gather materials, and deal damage. The only way to replenish your Divinity is with golden apples.",

  "power.touhouorigins.enlightened.name": "Enlightened",
  "power.touhouorigins.enlightened.description": "Although physically weaker, you no longer drop items on death, are much more attuned with gathering materials, and no longer need to eat.",

  "power.touhouorigins.immortal.name": "Immortal",
  "power.touhouorigins.immortal.description": "Along with physical capabilities being raised, you now have a Divinity bar. As long as you have Divinity, you are unable to die. Divinity passively goes down as you run around, gather materials, and deal damage. The only way to replenish your Divinity is with golden apples.",

  "origin.touhouorigins.jiang_shi.name": "Jiang Shi",
  "origin.touhouorigins.jiang_shi.description": "In Chinese folklore, jiang shi are reanimated corpses that move around by hopping with their arms outstretched. They are often compared to vampires because jiang shi attempt to suck qi, life energy, from the living, though they're actually more similar to zombies.",

  "power.touhouorigins.one_of_us.name": "One of Us",
  "power.touhouorigins.one_of_us.description": "All zombies are neutral towards you. However, villagers fear you and iron golems are hostile towards you.",
  "power.touhouorigins.life_drain.name": "Life Drain",
  "power.touhouorigins.life_drain.description": "Whenever you deal more than one damage, you drain the life force of your enemy, healing you for half a heart.",
  "power.touhouorigins.pestilence.name": "Pestilence",
  "power.touhouorigins.pestilence.description": "Your undead body is immune to poison and hunger, but also immune to regeneration. Instant health and instant damage are reversed, and you're weak to smite. You are also capable of zombifying villagers.",
  "power.touhouorigins.searing_light.name": "Searing Light",
  "power.touhouorigins.searing_light.description": "You burn in daylight if you aren't wearing a helmet, a mob head, or a pumpkin.",

  "origin.touhouorigins.vengeful_spirit.name": "Vengeful Spirit",
  "origin.touhouorigins.vengeful_spirit.description": "A vengeful spirit is a type of ghost created under special circumstances. They often seek revenge for unjust deeds done to them.",

  "power.touhouorigins.vengeful_harvest.name": "Vengeful Harvest",
  "power.touhouorigins.vengeful_harvest.description": "Killing a mob or another player grants you a stack. Once you have at least 5 stacks, you can activate this power to regenerate health. You can store up to 3 heals.",
  "power.touhouorigins.searing_rage.name": "Searing Rage",
  "power.touhouorigins.searing_rage.description": "The lower your health is, the more melee damage you deal. Opponents that strike you with melee will occasionally take fire damage.",

  "origin.touhouorigins.yuki_onna.name": "Yuki-Onna",
  "origin.touhouorigins.yuki_onna.description": "A yuki-onna is a spirit or a youkai associated with winter and snowstorms. It is said in some legends to be the spirit of an individual who has perished in the snow and cold.",

  "power.touhouorigins.chilling_touch.name": "Chilling Touch",
  "power.touhouorigins.chilling_touch.description": "Your attacks inflict slowness. The level of slowness increases the lower the health of the target is.",
  "power.touhouorigins.deadly_snow.name": "Deadly Snow",
  "power.touhouorigins.deadly_snow.description": "Snowballs you throw deal 2 damage.",
  "power.touhouorigins.snow_woman.name": "Snow Woman",
  "power.touhouorigins.snow_woman.description": "You regenerate health and gain a speed increase while in snowy biomes, while hot biomes slow you down. The Nether will set you ablaze unless wearing boots enchanted with frost walker.",
  "power.touhouorigins.ice_cold.name": "Ice-Cold",
  "power.touhouorigins.ice_cold.description": "You can craft ice from snowballs.",

  "origin.touhouorigins.haniwa.name": "Haniwa",
  "origin.touhouorigins.haniwa.description": "Expertly crafted statues in the form of long fallen warriors. Now given a fighting spirit and a will of iron, the haniwa warrior is proficient in many forms of combat while remaining durable thanks to their terracotta construction.",

  "power.touhouorigins.warrior_of_an_old_age.name": "Warrior of an Old Age",
  "power.touhouorigins.warrior_of_an_old_age.description": "You find yourself able to wield weapons with ease, increasing your attack speed.",
  "power.touhouorigins.quick_patch_up_job.name": "Quick Patch-up Job",
  "power.touhouorigins.quick_patch_up_job.description": "You can use clay to quickly heal yourself.",
  "power.touhouorigins.terracotta_skin.name": "Terracotta Skin",
  "power.touhouorigins.terracotta_skin.description": "Your body is made of hardened clay, not actual flesh. You are immune to thorns, cacti, berry bushes, fire, freezing, and take 30% less damage from all physical sources not stated in \"Fragile Structure\", but do not regenerate health naturally and are unaffected by healing effects. You also never get exhausted and have no need to eat.",
  "power.touhouorigins.fragile_structure.name": "Fragile Structure",
  "power.touhouorigins.fragile_structure.description": "While your terracotta is sturdy, it does not take sudden impacts well. You take triple damage from kinetic sources, explosions, and pickaxes",

  "origin.touhouorigins.moon_rabbit.name": "Moon Rabbit",
  "origin.touhouorigins.moon_rabbit.description": "Tools used by the Lunarians who have fled from their previous lives in search of greener pastures. They take with them their training and skills, but always live in fear of being found out and taken back to the lunar surface.",

  "power.touhouorigins.military_of_the_moon.name": "Military of the Moon",
  "power.touhouorigins.military_of_the_moon.description": "You start with a crossbow and a handful of arrows. You can activate this power to rapidly reload your crossbow. This only works with regular arrows.",
  "power.touhouorigins.strong_legs.name": "Strong Legs",
  "power.touhouorigins.strong_legs.description": "You are capable of jumping higher while sneaking and running longer than a regular person. You take slightly less fall damage.",
  "power.touhouorigins.timid_constitution.name": "Timid Constitution",
  "power.touhouorigins.timid_constitution.description": "You're not built for combat, and have 2 less hearts of health. You also swing slower while carrying melee weapons like axes, swords, and tridents.",

  "origin.touhouorigins.earth_rabbit.name": "Earth Rabbit",
  "origin.touhouorigins.earth_rabbit.description": "A rabbit can become a type of youkai after existing for a long period of time, gaining sentience and increased abilities in the process.",

  "power.touhouorigins.great_fortune_crest.name": "Great Fortune Crest",
  "power.touhouorigins.great_fortune_crest.description": "Due to your long age, you are capable of conferring good luck to others. Additionally, if you are attacked, your attacker is penalized with bad luck, increasing in intensity if you are killed.",
  "power.touhouorigins.natural_luck.name": "Natural Luck",
  "power.touhouorigins.natural_luck.description": "Increased luck attribute.",
  "power.touhouorigins.feeble_nature.name": "Feeble Nature",
  "power.touhouorigins.feeble_nature.description": "You have 3 less hearts of health and you're slightly smaller.",

  "origin.touhouorigins.hell_raven.name": "Hell Raven",
  "origin.touhouorigins.hell_raven.description": "Hell ravens have existed in the Hell of Blazing Fires for as long as it's been burning. Unlike normal ravens, they are born from the darkness of hell. Some Hell ravens might even end up absorbing a god to gain its powers.",

  "power.touhouorigins.blackened.name": "Blackened",
  "power.touhouorigins.blackened.description": "You rapidly heal yourself while standing in fire or lava.",
  "power.touhouorigins.born_in_flame.name": "Born in Flame",
  "power.touhouorigins.born_in_flame.description": "As Hell is your home, you're well acclimated and live there. You spawn in the Nether, and are immune to fire and lava. You also swim faster in lava and slower in water.",
  "power.touhouorigins.doom_design.name": "Doom Design",
  "power.touhouorigins.doom_design.description": "Contained within you is the incredible and awesome power of the sun, empowering you with great ability at a great price. All of your attacks inflict fire damage and have a chance to explode on contact. You take more damage from all sources, except explosions, and you explode on death.",
  "power.touhouorigins.smoldering_decay.name": "Smoldering Decay",
  "power.touhouorigins.smoldering_decay.description": "Your abilities stem from a fission core that can be drained from too much use. Anytime you deal or take damage, fill a bit of your \"Decay Meter\". Once half full, you are extremely weakened. Your Decay meter can be drained by resting in lava.",
  "power.touhouorigins.my_apocalypse.name": "My Apocalypse",
  "power.touhouorigins.my_apocalypse.description": "As long as your Decay meter is not half full, you can activate your special ability and go into a total core meltdown. Firing flames in all directions and ending with a massive explosion around you. Afterwards, your Decay meter will fill itself entirely.",

  "origin.touhouorigins.amanojaku.name": "Amanojaku",
  "origin.touhouorigins.amanojaku.description": "Amanojaku are a particularly twisted type of youkai. They're the spirits of contradiction and perversity.",

  "power.touhouorigins.turnabout.name": "Turnabout",
  "power.touhouorigins.turnabout.description": "",
  "power.touhouorigins.this_side_down.name": "This Side Down",
  "power.touhouorigins.this_side_down.description": "",
  "power.touhouorigins.mirror_movement.name": "Mirror Movement",
  "power.touhouorigins.mirror_movement.description": "",

  "origin.touhouorigins.kurayami.name": "Kurayami",
  "origin.touhouorigins.kurayami.description": "Kurayami are a category of wicked youkai capable of manipulating darkness. Although they are known to devour humans, most kurayami are susceptible to their own powers and are too simple minded to commit such acts. It's thought that these youkai were once very strong creatures whose true powers vanished long ago.",

  "power.touhouorigins.midnight_bird.name": "Midnight Bird",
  "power.touhouorigins.midnight_bird.description": "You have the ability to soar like a bird but will fall if hurt. You can float in position by holding shift.",
  "power.touhouorigins.is_that_so.name": "So Nanoka?~",
  "power.touhouorigins.is_that_so.description": "Every 30 seconds, you can spend some hunger to release a cloud of darkness that will extinguish and blind everyone nearby for 5 seconds including yourself.",
  "power.touhouorigins.chomp.name": "Chomp!",
  "power.touhouorigins.chomp.description": "You can chomp on any mob or player under the effects of \"So Nanoka?~\" by attacking with your bare fists. Chomped victims will directly lose 2 full hearts of health and you will be given 4 absorption hearts. If the victim is killed, your hunger and health will also be completely restored.",
  "power.touhouorigins.light_absorption.name": "Light Absorption",
  "power.touhouorigins.light_absorption.description": "You hate being exposed to the sun and heat, and subconsciously surround yourself in darkness to cool off. When exposed to direct sunlight or in the nether, you are afflicted with darkness. Others will see you as a black sphere in this state.",
  "power.touhouorigins.crude_appetite.name": "Crude Appetite",
  "power.touhouorigins.crude_appetite.description": "You relish the taste of raw meat, it's almost as good as eating a live human! Eating raw meat gives 75% more hunger, while all other foods give 50% less hunger.",
  "power.touhouorigins.mysterious_seal.name": "Mysteriously Sealed",
  "power.touhouorigins.mysterious_seal.description": "An unknown seal envelops your body and soul. You have 5 less hearts of health and you're 20% smaller. Perhaps there is some way to break it?",

  "touhouorigins.subtitles.entity.fairy.heal": "Fairy regenerates",
  "touhouorigins.subtitles.entity.fairy.fly": "Fairy flutters",
  "touhouorigins.subtitles.entity.kappa.camouflage_activate": "Camouflage activates",
  "touhouorigins.subtitles.entity.kappa.camouflage_deactivate": "Camouflage deactivates",
  "touhouorigins.subtitles.entity.kappa.dry": "Kappa dries",
  "touhouorigins.subtitles.entity.satori.recollect": "Satori recollects",
  "touhouorigins.subtitles.entity.satori.close_eye": "Third eye closes",
  "touhouorigins.subtitles.entity.generic.gust": "Wind rushes",
  "touhouorigins.subtitles.entity.wolf_tengu.growl": "Wolf Tengu growls",
  "touhouorigins.subtitles.entity.celestial.evolve": "Celestial evolves",
  "touhouorigins.subtitles.entity.celestial.divinity_restore": "Divinity restores",
  "touhouorigins.subtitles.entity.celestial.divinity_deplete": "Divinity depletes",
  "touhouorigins.subtitles.entity.vengeful_spirit.heal": "Vengeful Spirit regenerates",
  "touhouorigins.subtitles.entity.rabbit.hop": "Rabbit hops",
  "touhouorigins.subtitles.entity.moon_rabbit.activate": "Moon Rabbit prepares to fire",
  "touhouorigins.subtitles.entity.hell_raven.decay": "Decay fills",
  "touhouorigins.subtitles.entity.hell_raven.alert": "Alarm blares",
  "touhouorigins.subtitles.entity.hell_raven.shoot": "Hell Raven shoots",
  "touhouorigins.subtitles.entity.generic.flip": "Something flips",
  "touhouorigins.subtitles.entity.amanojaku.flip": "Amanojaku flips",
  "touhouorigins.subtitles.entity.generic.reverse": "Something reverses",
  "touhouorigins.subtitles.entity.kurayami.flight": "Kurayami whooshes",
  "touhouorigins.subtitles.entity.kurayami.darkness": "Darkness gathers",
  "touhouorigins.subtitles.entity.kurayami.chomp": "Kurayami chomps",

  "death.attack.sun": "%1$s was vaporized",
  "death.attack.sun.player": "%1$s was vaporized whilst fighting %2$s",
  "death.attack.probe": "%1$s was probed by %2$s",
  "death.attack.probe.item": "%1$s was probed by %2$s using %3$s",
  "death.attack.fireThorns": "%1$s burned their hand fighting %2$s",
  "death.attack.fireThorns.item": "%1$s burned their hand on %3$s fighting %2$s",
  "death.attack.chomp": "%1$s was devoured by %2$s",
  "death.attack.chomp.item": "%1$s was devoured by %2$s using %3$s",

  "power.touhouorigins.recollection.player": "%1$s has the following memories...",
  "power.touhouorigins.recollection.spawnX": "Respawn X",
  "power.touhouorigins.recollection.spawnY": "Respawn Y",
  "power.touhouorigins.recollection.spawnZ": "Respawn Z",
  "power.touhouorigins.recollection.fail": "Unable to read %1$s's memories!",
  "power.touhouorigins.recollection.alert": "You have a feeling like someone read your memories",
  "power.touhouorigins.recollection.alert_fail": "You have a feeling like someone attempted to read your memories",
  "power.touhouorigins.ostracized.trade": "The %1$s refuses to trade with you",
  "power.touhouorigins.my_apocalypse_alert": "Total core meltdown in progress... Evacuate the area!",
  "power.touhouorigins.midnight_bird_cooldown": "You are still recovering from being hurt!",

  "touhouorigins.gui.badge.upgrade": "Upgrade path",

  "advancements.touhouorigins.root.title": "Touhou Origins",
  "advancements.touhouorigins.root.description": "Welcome to Gensokyo",
  "advancements.touhouorigins.close_eye.title": "Rejection of Nature",
  "advancements.touhouorigins.close_eye.description": "Close your third eye",
  "advancements.touhouorigins.enlightened.title": "Enlightened",
  "advancements.touhouorigins.enlightened.description": "As a Celestial, attain enlightenment",
  "advancements.touhouorigins.immortal.title": "Immortal",
  "advancements.touhouorigins.immortal.description": "As a Celestial, attain immortality"
}